import React, { useState, useContext, useEffect } from "react";
import { Alert, Modal, StyleSheet, Text, Pressable, View } from "react-native";
import { ScrollView } from "react-native-gesture-handler";


const TermsModal = () => {
  const [modalVisible, setModalVisible] = useState(false);

  return (
    <View>
      <View style={styles.centeredView}>
        <Modal
          animationType="slide"
          transparent={true}
          visible={modalVisible}
          onRequestClose={() => {
            setModalVisible(!modalVisible);
          }}
        >
          <View style={styles.centeredView}>
            <View style={styles.modalView}>
              <Text style={styles.modalText}>
                תנאי השימוש ומדיניות הפרטיות
              </Text>
              <ScrollView>
                <View style={styles.text}>
                  <Text style={styles.text}>תנאי השימוש ומדיניות הפרטיות שלהלן (יחד - "התקנון") חלים על כל גולש או משתמש בשירותים הדיגיטליים השונים (להלן "הגולש" או "המשתמש") המוצעים באתר ו/או ביישומון ("אפליקצייה") זה ו/או באמצעותם יחד או לחוד (להלן יחד "האתר"), המתופעלים על-ידי המפעילים (להלן "החברה"), מתוקף התקשרותם כדין עם תאגידים ו/או רשויות ו/או נותני שירותים אחרים ככל שיהיו מעת לעת (להלן יחד "התאגידים").{"\n"}</Text>
                  <Text style={styles.text}>האתר מיועד לאפשר לך לקבוע פיעלות משותפת עם משתמשים אחרים וכן להזין מידע על הפעילות ולאפשר לכלל המשתמשים לצפות במידע זה. (להלן "התשלומים") ליזום פניות אל משתמשים, לשתף תמונות או מיקום או נתוני תקשורת אחרים לפי צורך (להלן יחד - "השירותים")** למען הנוחיות בלבד, תקנון זה מנוסח בלשון זכר אולם הוראותיו מתייחסות בהתאמה כמובן גם לנקבה. עמכן הסליחה.{"\n"}</Text>
                  <Text style={styles.text}>תחולה והסכמתך לתנאי התקנון{"\n"} 1.        השימוש באתר, בתכנים הכלולים בו ובשירותים השונים הזמינים דרכו או מוצעים על-ידו, מעיד על הסכמתך להוראות ולתנאי תקנון זה, לרבות התחייבותך לפעול על-פיו, על כן הנך מתבקש לקרוא את התנאים שלהלן בקפידה{"\n"}.2.        אם אינן מעוניין לקבל ו/או לאשר את תנאי התקנון שלהלן, כולם או חלקם, עליך להפסיק את השימוש באתר לאלתר{"\n"}.3.        החברה שומרת לעצמה את הזכות לשנות, למחוק ו/או להוסיף על תנאי תקנון זה בכל עת וללא התחייבות למתן הודעה מוקדמת או בדיעבד. שימושך באתר לאחר ביצוע תוספות ו/או שינויים מעיד על הסכמתך לשינויים אלו, ולכן אנו ממליצים לך לעיין בתנאים אלו מחדש מעת לעת. אם אינך מסכים לשינויים מסוימים, אנא הימנע מהמשך שימוש באתר או פנה אלינו לסיוע כדי לתת לך פתרונות חלופיים. נוסח התקנון המחייב והקובע בכל מועד הינו נוסח התקנון המפורסם באתר{"\n"}.4.        תנאי תקנון זה אינם באים להחליף תנאים, תנאי שימוש או מדיניות פרטיות של כל אתר או עמוד אחר העשוי להיות מקושר או זמין באמצעות או דרך אתר זה. הגלישה והשימוש בכל אתר אחר כאמור כפופים לתנאיו הפרטניים של אותו אתר, נוסף וללא קשר לתנאי תקנון זה, ומומלץ על כן לעיין בהם בנפרד{"\n"}.5.        תנאים אלה המפורטים להלן חלים על כל שימוש באתר, לרבות צריכה ו/או ביצוע התשלומים דרכו ו/או באמצעותו ו/או באמצעות סליקת התשלומים על ידי חברה צד ג, צפייה ו/או גישה לתכנים הכלולים בו והשירותים המוצעים בו, בין אם באמצעות מחשב ביתי, מחשב נייד, מכשיר סלולארי, טאבלט ו/או כל מחשב ו/או מכשיר תקשורת אחר, דרכו מתאפשרת הגישה לאתר ו/או לאפליקציה, באמצעות כל תצורה ודרך כל מערכת הפעלה מתאימה. בנוסף, תנאים אלו חלים על השימוש באתר באמצעות כל רשת ו/או אמצעי תקשורת ו/או חיבור אחרים{"\n"}.6.        החברה תהא רשאית לפעול בדרך של השעיה, חסימה ו/או נקיטת כל פעולה (משפטית או אחרת) כנגד כל משתמש אשר יפר את תנאי השימוש שלהלן.קישורים ותנאים נלווים של צדדים שלישיים{"\n"} 7.        תנאי תקנון זה אינם באים להחליף תנאים, תנאי שימוש או מדיניות פרטיות של כל אתר, ישומון או עמוד אחר העשוי להיות מקושר או זמין דרך אתר זה (להלן "אתרים מקושרים"). אם תבחר לגלוש או להשתמש באתרים חיצוניים, דרך האתר או בעקבות לחיצה על קישור ממנו, אזי שהשימוש בהם יהיה כפוף גם לתנאיהם הפרטניים, נוסף על תנאי מסמך זה, ומומלץ על כן לעיין בהם בנפרד{"\n"}.8.        קישורים שעשויים להיות מוצגים באתר זה, לאתרים חיצוניים או אחרים, מוצגים לנוחיותך בלבד. כל הסתמכות על אתרים מקושרים או על תוכנם, שימוש בהם או מסירת פרטים דרכם, הינה באחריותך בלבד ובהתאם לתנאי השימוש, תקנון, ומדיניות הפרטיות של אותם אתרים, בנפרד ובאופן בלתי תלוי מתנאי תקנון זה. כמו-כן, החברה שומרת לעצמה את הזכות להסיר מהאתר בכל עת קישורים המופיעים בו, או להימנע מהוספת קישורים חדשים, הכל לפי שיקול דעתה המוחלט.{"\n"}</Text>
                  <Text style={styles.text}>הגבלת אחריות לתוכן האתר וזמינות האתר{"\n"}9.        החברה עושה מאמצים רבים כדי לספק לך חווית שימוש איכותית ובטוחה באתר. עם זאת, האתר אינו חסין מתקלות ו/או בעיות ועשויה שלא להיות לך גישה לאתר מעת לעת{"\n"}.10.    האתר, השירותים והתכנים הזמינים ו/או עשויים להיות זמינים דרך האתר, וכל הכלול בו, מונגשים עבורך כפי שהם וללא התחייבות לזמינותם ( As Is ו- As Available ).{"\n"}11.    החברה אינה ולא תהא אחראית, במישרין או בעקיפין, במפורש או במשתמע, לזמינות, אמיתות, מהימנות ו/או מידת הדיוק של תכני האתר או שירותים הניתנים או מוצעים דרכו, בפרט אם מדובר בתכני צד שלישי ו/או נתונים המוצגים מטעם תאגידים חיצוניים. כל הסתמכות מצידך על תוכן המוצג באתר או דרכו הינה באחריותך המלאה{"\n"}.12.    החברה אינה אחראית לאי דיוקים ו/או לטעויות שנפלו ביחס לתוכן ו/או ביחס לשירותים המוצעים דרכו או לנתונים המוצגים באמצעותם. החברה מבהירה בזאת שהתוכן הכלול באתר הינו למטרות כלליות ואינפורמטיביות בלבד ולנוחיותך בלבד, ואינו מהווה המלצה ו/או חוות דעת ביחס אליו. כל הסתמכות על הצהרות, הבעות עמדה, עצות או כל תוכן אחר המוצג באתר נעשה לפי שיקול דעתך ובאחריותך הבלעדית. עליך לבצע בעצמך את כל ההערכות והבדיקות לגבי שירות או תשלום או נתון אחר המוצג בהקשר לשירותים, והינך מוותר ותהיה מנוע מלהעלות כנגד החברה כל טענה לגבי הסתמכות כלשהיא עליה{"\n"}.13.    הנך רשאי להשתמש באתר, בשירותים דרכו ובתוכן הזמין דרכו למטרות פרטיות ואישיות ובלתי מסחריות בלבד. תוכן האתר אינו יכול לשמש בסיס לצורך קבלת החלטות כספיות, משפטיות, אישיות ו/או אחרות מצידך, וכל פעולה הנעשית על-ידך בהתבסס על תוכן באתר היא באחריותך בלבד ולפי שיקול דעתך הבלעדי.{"\n"}14.    כל תוכן ו/או נתון ו/או מידע המובאים באתר בקשר לשירותים ו/או לתאגידים, אשר מקורם בצדדים שלישיים לחברה, לרבות סכומים, הערכות או הצעות, מדדים, חישובים, תוצאות, מפרטים, הוראות פעולה ונתונים אחרים מטעם או על בסיס נתוני צד שלישי, נמסרים על-ידי הצד השלישי ואינם באחריות החברה בשום אופן.{"\n"}15.    החברה לא תהא אחראית לאף נזק שנגרם ו/או עלול להיגרם לך ו/או לצד שלישי כלשהוא כתוצאה, במישרין או בעקיפין, מן השימוש באתר, כולל נזק שנגרם בעקבות שימוש ביישומי תוכנה ו/או קבצים ו/או תכנים אשר הורדו ישירות מהאתר ו/או הופעלו דרכו כתוצאה מהשימוש באתר.{"\n"}16.    למען הסר ספק, שיבוש ו/או תקלה ו/או כשל בקליטת פרטי משתמש באתר או דרכו, לרבות שיבוש ברישום לאתר או לשירות נלווה דרכו ו/או בקליטת תשלום או אמצעי תשלום, לא יהוו עילה לכל טענה ו/או תביעה מצד המשתמש באתר.{"\n"}17.    החברה רשאית להתיר או להגביל או לאסור את גישת המשתמש לאתר בכל זמן על פי שיקול דעתה הבלעדי ושומרת לעצמה את הזכות הבלעדית לשנות או להפסיק את הפעלת האתר, כולו או חלקו, בכל זמן וללא מתן הודעה, ככל שיידרש בנסיבות המתאימות, ומבלי שתהיה למשתמש כל טענה, זכות ו/או תביעה בקשר לכך.{"\n"}18.    החברה תהיה רשאית להתנות את הכניסה ו/או השימוש באתר, כולו או חלקו, ברישום ו/או בתשלום, ומבלי שתהיה למשתמש כל טענה, זכות ו/או תביעה בקשר לכך.{"\n"}</Text>
                  <Text style={styles.text}>שימושים אסורים באתר{"\n"}19.    אינך רשאי לבצע כל פעולה אשר תגרום ו/או תייצר עומס בלתי סביר על האתר, שרתיו ומערכותיו, ו/או כל פעולה העלולה לפגוע באתר, בתפעולו, בתכנים ובאופן הצגתם{"\n"}.20.    ללא קבלת הרשאה מפורשת, כתובה מראש מהחברה, אינך רשאי לבצע את הפעולות ו/או את המעשים הבאים:{"\n"}(1)      שימוש מסחרי באתר ו/או בתוכנו ו/או שימוש בהם לשם יצירת מאגר מידע ו/או לקט;{"\n"}(2)      להעתיק, לשחזר, לשנות, לעבד, לתרגם, לבצע הנדסה חוזרת, להפיץ, לשדר, להציג, לבצע, לשכפל, לפרסם ולאחסן את תוכן האתר, כולו או חלקו;{"\n"}(3)      להפעיל או לאפשר הפעלת כל יישום מחשב או כל אמצעי אחר, לרבות תוכנות מסוג Crawlers, Robots וכדומה, לשם חיפוש, סריקה, העתקה או אחזור אוטומטי של תוכן האתר{"\n"}(4)      להציג תוכן מהאתר בתוך מסגרת (iframe ) גלויה או סמויה או להציג את תוכן האתר בכל דרך שהיא, המשנים את עיצובם המקורי באתר ו/או המחסירים דבר כלשהוא;{"\n"}(5)      לשבש או להפר כל זכות של משתמש אחר באתר ו/או לפגוע בכבודו או בפרטיותו של משתמש אחר ו/או כל פגיעה אחרת.{"\n"}(6)      להשתמש באתר ו/או בתוכן האתר כדי לפגוע בשמו הטוב של כל אדם ו/או לפרסם דברי הסתה, הונאה, תרמית, לשון הרע ו/או כל מידע אחר שהינו שקרי, בלתי אמין או שיש בו כדי לפגוע במזיד בכל צורה.{"\n"}21.    אי עמידה בכל אחת ממגבלות אלו, עלולה להוביל למניעת גישתך לאתר ואף לחשוף אותך לאחריות אזרחית ו/או פלילית על-פי כל דין.{"\n"}</Text>
                  <Text style={styles.text}>אבטחת מידע{"\n"}22.    הנהלת האתר פועלת לאבטח את האתר, לרבות המידע המוצג בו, נגיש באמצעותו או נמסר דרכו, בכל אמצעי האבטחה הסבירים והמתקדמים, לרבות המידע שהוזן במערכת האתר בידי משתמש האתר.{"\n"}23.    כמו כן, החברה נוקטת באמצעים סבירים להגנה על האתר ועל רכיבי חומרה ותוכנה הקשורים בתפעולו ודואגת לעדכנם באופן שוטף, בין היתר, כדי להגן על האתר ועל תוכנו מפני חדירות, פרצות או האזנות בלתי מורשות.{"\n"}24.    החברה עושה ככל שיכולתה בכדי להגן על סודיות הנתונים שנמסרו על ידי משתמשי האתר ולקוחותיה, זאת תוך נקיטת אמצעי זהירות מקובלים ושימוש בטכנולוגיות אבטחה מתקדמות.{"\n"}25.    עם זאת, החברה אינה יכולה להתחייב לאבטחה הרמטית או מוחלטת, כי לא תתבצע חדירה בלתי חוקית ללא הרשאתה למערכות האתר אשר תוביל לחשיפת מידע לגורמים זרים ו/או לא מורשים ו/או לאובדנו של המידע. לפי-כך, מובהר בזאת כי החברה לא תהא אחראית ולא תישא בכל אחריות במקרה של חדירה או פריצה ו/או נזק כלשהוא שנגרם בשל השימוש באתר ו/או בתוכן המוצג בו ו/או בשירותים הנלווים לו, על-ידי המשתמש באתר או מי מטעמו.{"\n"}26.    לנושא שימוש וסליקה של כרטיסי אשראי מהאתר או דרכו, זו נעשית באופן מוצפן ומאובטח באמצעות חברת סליקת אשראי חיצונית, העושה שימוש בשיטות הצפנה חדישות ועל ידי מנגנוני הצפנה שהינם בהתאם לתקנים בינלאומיים ולפי הנחיות חברות האשראי הרלבנטיות.{"\n"}</Text>
                  <Text style={styles.text}>מדיניות הפרטיות, רישום ואיסוף מידע דרך האתר ושמירתו כללימטרת מדיניות זו להסביר מהם נוהגי הנהלת האתר ביחס לפרטיות המשתמשים באתר, וכיצד משתמשת הנהלת האתר במידע, הנמסר לה על-ידי המשתמשים באתר או הנאסף על-ידה בעת השימוש באתר." מידע אישי" משמעו כל מידע מזהה אודותייך אשר תמסור במסגרת הרשמתך או במסגרת השימוש באתר או באפליקציה, או בשירותים נלווים ואחרים המוצעים או מופעלים דרך האתר, וכן כל מידע אשר ייאסף אודותייך במסגרת השימוש באתר. שימוש במידע אישי אודותייך ייעשה אך ורק בהתאם למפורט בתקנון זה או לפי חובות שבדין.האתר אינו אוסף מידע אישי מזוהה אודותיך אלא אם תמסור מידע זה מיוזמתך בעת מילוי טופס מקוון באתר, רישום לאזור אישי או לשירות או לרשימה כלשהם, יצירת קשר וכיו"ב.רישום, מסירה ושמירת מידעייתכן כי חלק מהשירותים באתר טעונים או יהיו טעונים הרשמה. במסגרת ההרשמה תידרש למסור מידע אישי, כדוגמת שמך, כתובתך, דרכי ההתקשרות עמך ו/או כתובת הדואר האלקטרוני שלך, ובהתאם לצורך גם פרטים נוספים לצורך זיהוי, כגון מספר תעודת זהות או פרטים קשורים. השדות, שחובה למלא, יסומנו במפורש. בלי למסור את הנתונים המתבקשים בשדות החובה לא תוכל להירשם לאזורים ו/או לשירותים הטעונים רישום ו/או לבצע את הפעולות המתבקשות עקב כך באמצעות האתר (להלן "ההרשמה").ייתכן כי כחלק בלתי נפרד מהליך הרשמה מסוים, או לפי צורך, וכתנאי לסיום תהליך הרישום, לצורך זיהוי ו/או אימות זהות, תתבקש לאמת את זהותך בהתאם למידע שמסרת ובאמצעות פרטי הקשר שלך. אין ביצירת קשר לצורך זיהוי או אימות כאמור כדי לרשום אותך לרשימת תפוצה אחרת כלשהיא, ואין בכך כדי להעלות טענה כלשהיא מצדך לעניין משלוח דיוור או ביצוע פניה בניגוד לדין כלשהוא.בעת שימוש באפליקציה, ייתכן שהרשמה לאפליקציה ו/או שירותים מסוימים המופעלים דרכה, יחייבו שימוש במערכת מסרונים ( SMS ) ו/או התראות או הודעות פנימיות, לצורך ניהול, תפעול, אימות, זיהוי, או כל פעולה אחרת שתידרש לצורך תפעולו התקין של השירות המתבקש דרך מכשירך. לצורך כך מתבקשת הסכמתך הכללית, מראש, עם הסכמתך לתקנון זה, לשימוש במערכת המסרונים שבמכשירך וכדי לשלוח לך הודעות אישיות או התראות לפי הצורך כאמור.בעת שימוש באתר ובפרט באפליקצייה דרך מכשיר נייד כלשהוא, החברה עשויה לאסוף ולהשתמש במידע על המיקום שלך או על מסלול התנועה שלך על מנת לספק לך שירותים נלווים העשויים להידרש לצורך ניהול ו/או ייעול ו/או אספקת שירותי החברה, או כדי לספק לך מידע על שירותים המותאמים למיקומך.לחברה מאגרי מידע רשומים בהם ישמרו ויאובטחו כלל פרטיך כחוק (להלן "המאגרים"). החברה רשאית לעשות שימוש במידע שייאסף אודותיך למאגרים בהתאם למטרותיהם הרשומות, ובין היתר: לצורך ניהול ותפעול כל שירות המבוקש על-ידך, ולשם התקשרות, עדכון, אישור ו/או יידוע שלך בכל עניין ו/או נושא הקשור לשירות המתבקש על-ידך; טיפוח ועידוד נאמנות המשתמשים באמצעות ניתוח מאפיינים, עיבוד מידע ו/או דיוור ישיר כדין בהתאם למאפיינים במאגר; עריכת ניתוחים, סקרים ומחקרים סטטיסטיים; טיפול בתלונות, פניות ו/או תביעות ככל שתהיינה.35.    אינך מחוייב למסור מידע באמצעות האתר על-פי חוק, ובמסירתו, ככל שתתבקש, הנך מאשר כי העברת המידע לחברה או באמצעותה היא על אחריותך בלבד, מרצונך החופשי ובהסכמתך, ולא תהיה לך כל טענה ו/או תביעה כלפי החברה ונציגיה בנושא.36.    כמו כן, ככל שתמסור או תעלה כל מידע אישי לחברה דרך האתר, הינך מצהיר בזאת כי המידע שתמסור ו/או תעדכן, הנו נכון אמין ומדויק וכי הנך מוסר את המידע בשמך ועבור עצמך בלבד, או שהורשת כדין למסור מידע זה עבור אחר, ובכל מקרה תהא אחראי בלעדי למסירת מידע זה.{"\n"}37.    ייתכן שמעת לעת, תתאפשר שליחת קורות חיים או פרטי תעסוקה, לצורך הגשת מועמדות משתמש באתר לעבודה בחברה או מטעמה. ככל שתבחר לשלוח קורות חיים או פרטים אחרים כאמור לצורך זה, הנך מאשר ומסכים כי הפרטים יישמרו במאגר החברה הייעודיים למטרת בחינת הבקשה הספציפית או לשם מיון ו/או השמה לתפקידים אחרים העשויים לתאום לכישורייך. אם בסופו של תהליך בחינה או מיון כאמור לא תימצא משרה ההולמת את כישורייך, החברה שומרת לעצמה את הזכות לשוב ולפנות אליך בעתיד, בהתבסס על נתונים אלו, כדי להציע לך משרות אחרות העשויות להתאים לך.{"\n"}</Text>
                  <Text style={styles.text}>שימוש במידע וניתוחוהחברה רשאית לאסוף וכן לעשות שימוש במידע שנמסר על ידי המשתמש במועד ההרשמה ו/או במידע אשר הצטבר אודות המשתמש, לרבות במהלך השימוש באתר למען המטרות המנויות בסעיף 34 לעיל, וכן על מנת לשפר, להעשיר או לשנות (לרבות שינוי של האתר המוצג למשתמש) את האתר, את השירותים והתכנים המוצעים באתר, וכן על מנת לעדכן את המשתמש באשר לשירותים שונים המוצעים על ידי החברה ו/או מי מטעמה או הקשור אליה עסקית. האתר עשוי להפעיל כלים אוטומטיים לצורך אפיון השימושים באתר, לצורך תפעול וייעול פעילות האתר או התאמתו להעדופת המשתמש. כלים אלו עשויים לאסוף ולשמור מידע כללי ובלתי מזוהה אודותיך ואודות אופן השימוש שלך באתר, ובין היתר, גם את פרטי ספק שירותי האינטרנט שלך, כתובתך בפרוטוקול האינטרנט (כתובת IP ) ושם המתחם לצורך גישה לאתר, מיקום המכשיר בו נעשה שימוש בגישה לאתר, זמני ואופני השימוש באתר, סוג הדפדפן שלך ופרטים סטטיסטיים נוספים המעידים על אופן השימוש באתר ובשירותים דרכו.{"\n"}40.    בנוסף, החברה עשויה לעשות שימוש בקבצי מידע מסוג "קוקיס" ( Cookies). המדובר ב קבצי טקסט, שהדפדפן של המשתמש יוצר לפי פקודה ממחשבי החברה.{"\n"}41.    קבצים אלו מאפשרים לשמור את הפרטים שהזנת לטפסים שונים באתר, או באזורי רישום או הפעלת שירותים, ובכך חוסכים ממך את זמן מילוי הפרטים בשנית בביקורך הבא. כמו כן, הקבצים עשויים להכיל מידע בדבר הדפים שבהם ביקרת, משך השייה באתר, מקור ההגעה לאתר ועוד. המידע בעוגיות מוצפן, והחברה נוקטת צעדי זהירות כדי להבטיח שרק מחשבי החברה או מי מטעמה יוכלו לקרוא ולהבין את המידע האגור בהם.{"\n"}42.    אם אינך מעוניין לקבל או להפעיל את ה"קוקיס", תוכל לחסום אותם בכל עת באופן עצמאי על ידי שינוי הגדרות הדפדפן שלך. חלק מקובצי הקוקיס עשויים לפקוע כאשר תסגור את הדפדפן או את היישום בו אתה משתמש, וייתכן שאחרים יישמרו על גבי הזיכרון במכשירך או במחשבך. בכל עת, באפשרותך למחוק את קובצי הקוקיס, גם אם נשמרו אצלך. מוצע לעשות כן רק אם אתה משוכנע שאינך רוצה שהאתר, התכנים המופיעים בו והשירותים המוצעים דרכו יותאמו להעדפותיך.{"\n"}</Text>
                  <Text style={styles.text}>העברת מידע {"\n"}43.   החברה מתחייבת כי לא תעשה כל שימוש במידע הקנייני שלך, ככל שיהיה בהחזקתה, ו/או בכל מידע אחר אודותייך לצרכים שאינם נוגעים לשירות המסופק לך.{"\n"}44.   החברה תנקוט באמצעים סבירים ומקובלים על מנת לשמור ולמנוע העברת פרטים אישיים המזהים את המשתמש בשמו ו/או בפרטי זהותו לידי לצדדים שלישיים. זאת, למעט במקרים שיפורטו להלן:{"\n"}(1)     על-פי דרישה ממך או בהסכמתך ו/או על מנת לספק לך שירות שביקשת ו/או נרשמת אליו;{"\n"}(2)     במקרה בו העברת פרטייך נדרשת לצורך השלמת בקשה ו/או פנייה מטעמך ו/או אספקת שירות ו/או העברת תשלום מטעמך;(3)     במקרה בו בוצעה מצידך הפרת תנאי תקנון זה ו/או במקרים בהם ביצעת או ניסית לבצע באמצעות האתר פעולה המנוגדת לתקנון או לכל דין;(4)     על-פי צו שיפוטי או דרישת רשות מוסמכת על-פי חוק או לצורך מניעת ביצוע עבירה;{"\n"}(5)     בכל מקרה בו תסבור החברה כי מסירת המידע נחוצה על מנת למנוע נזק חמור לרכושו ו/או לגופו של אדם, או על מנת למנוע נזק חמור אחר לפי שיקול דעתה;{"\n"}(6)     במקרה בו תתעורר מחלוקת ו/או טענה ו/או תביעה ו/או דרישה ו/או הליכים משפטיים בינך ו/או מי מטעמך לבין החברה ו/או מי מטעמה;{"\n"}(7)     במקרה בו תעביר ו/או תמחה החברה את זכויותיה ו/או פעילותה לצדדים שלישיים ובלבד שאלו האחרונים יקבלו על עצמם את הוראות התקנון דנן{"\n"}.45.   אין באמור לעיל כדי לגרוע מזכות החברה להעביר לצדדים שלישים מידע אגרגטיבי או מידע שאינו אישי, או אשר אין בו כדי לזהות את המשתמש בשמו ו/או בפרטי זהותו באופן ישיר או באופן סביר, או אשר אין בו כדי לפגוע בפרטיות המשתמש.{"\n"}</Text>
                  <Text style={styles.text}>קניין רוחני{"\n"}46.   אלא אם צוין או סומן אחרת במפורש, החברה הינה הבעלים או מורשית כדין בכל זכויות הקניין הרוחני באתר ובתוכן המצוי בו או נגיש ישירות דרכו, לרבות העיצוב, קוד המקור והקוד הבינארי, סמלים מסחריים, מושגים, סודות מסחריים, סימני מסחר וסימני שירות, זכויות יוצרים, מוניטין, נתוני שוק, זכויות מוסריות, מידע טכני וכל זכות מקבילה או נגזרת לכל אחד מן האמורים לעיל. שימוש בכל אלו, ללא הסכמה מפורשת מראש ובכתב מהחברה הינו אסור ויהווה הפרת זכויותיה של החברה ו/או של צדדים נוספים אחרים על-ידך.{"\n"}47.   אין להשתמש, להעתיק, לשכפל, לשחזר, לעבד, להפיץ, להציג או לפרסם כל תוכן מהאתר או לעשות בו כל שימוש לצרכים מסחריים או פרטיים, על-ידך או על-ידי אחר מטעמך, ללא הסכמה מפורשת מראש ובכתב מהחברה.{"\n"}</Text>
                  <Text style={styles.text}>שונות{"\n"}48.   אין בתקנון זה או באיזו מהוראותיו כדי ליצור, ולא יפורשו כיוצרים כל שותפות, מיזם משותף, יחסי עובד מעביד, סוכן או שלוח בינך לבין החברה או מי מטעמה בכל אופן.{"\n"}49.    א ם תנאי בתקנון זה ימצא בלתי חוקי, בטל או בלתי אכיף מכל סיבה, תנאי זה ימחק מהתקנון ומחיקתו לא תשפיע על חוקיות ותקפות יתר התנאים . במקרה שכזה, יראו בקיומו של תנאי דומה אחר אכיף במקום התנאי שנמחק או הוסר.תנאי תקנון זה מהווים את ההסכם המלא בינך לבין החברה בכל הנוגע לאופן השימוש באתר ומחליפים כל הבנה ו/או הסכמה אחרת, בעל-פה או בכתב, הנוגעת לשימוש באתר ובתוכנו האתר עשוי לפרסם ולפרט מודעות דרושים ומשרות פנויות בחברה או דרכה, בעמודים הייעודיים לכך. אין במודעות אלו או בתוכנן כדי להתחייב או להביא לקבלתו של מי מהפונים לעבודה או המתעניינים במשרה בחברה, או לגרוע או לשנות מהליכי מיון אחרים העשויים להתבצע על-ידי החברה. מודעות דרושים והצעות משרה מופנות בכל מקרה לשני המינים,  וזאת אף אם לא צוין זאת במפורש בגוף המודעה.{"\n"}52.   על השימוש באתר ו/או בכל תביעה, דרישה ו/או בקשה הנובעים משימוש בו, יחולו דיני מדינת ישראל בלבד ומקום השיפוט יהיה בבית המשפט בתל-אביב בלבד. הדין המהותי והפרוצדוראלי יהיה הדין הישראלי, זאת בכפוף לזכות   החברה לנקוט בהליכים משפטיים בבתי המשפט בהם מצויים כתובת המשתמש ו/או מקום עסקו ו/או נכסיו או חלק מהם לשיקול החברה.{"\n"}</Text>
                  <Text style={styles.text}>יצירת קשר{"\n"}53.     בכל מקרה של שאלה ו/או בקשה, אנא פנה/י אלינו בדואר אלקטרוני fantasyleaguehood@gmail.com.{"\n"}</Text>

                </View>
                <View style={styles.ButtonView}>
                  <Pressable
                    style={[styles.button, styles.buttonClose, styles.ApproveBtn]}
                    onPress={() => setModalVisible(!modalVisible)}>
                    <Text style={styles.textStyle}>הבנתי</Text>
                  </Pressable>
                  <Text>             </Text>
                </View>
              </ScrollView>
            </View>
          </View >
        </Modal >
      </View >
      <Pressable
        style={[styles.button, styles.buttonOpen]}
        text=""
        onPress={() => setModalVisible(true)}
      />
      {/* <Pressable
        style={[styles.button, styles.buttonOpen]}
        onPress={() => setModalVisible(true)}>
        <Text style={styles.textStyle}>צפייה בתוצאות</Text>
      </Pressable> */}
    </View>

  );
};

const styles = StyleSheet.create({
  centeredView: {

  },
  modalView: {
    margin: 20,
    backgroundColor: "white",
    borderRadius: 20,
    padding: 35,
    alignItems: "center",
    shadowColor: "#000",
    shadowOffset: {
      width: 0,
      height: 2,
    },
    shadowOpacity: 0.25,
    shadowRadius: 4,
    elevation: 5,
  },
  button: {
    borderRadius: 20,
    padding: 10,
    elevation: 2,
  },
  buttonOpen: {
    backgroundColor: "green",
  },
  buttonClose: {
    backgroundColor: "#2196F3",
  },
  textStyle: {
    color: 'white',
    fontWeight: "bold",
    textAlign: "center",
  },
  modalText: {
    marginBottom: 15,
    textAlign: "center",
    fontWeight: "bold",
    fontSize: 25
  },
  ButtonView: {
    textAlign: "center",
    flexDirection: "row",
    margin: 45,
  },
  CancelBtn: {
    backgroundColor: "red",
  },
  ApproveBtn: {
    backgroundColor: "green",
  },
  text: {
    fontSize: 15,
  }
});

export default TermsModal;
